0_org/nut.b
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(sideWalls|bottom|pier)"
    {
        /*type            nutkRoughWallFunction;
    	Ks		        uniform 0;
        Cs	            uniform 0.5;
        value           uniform 0;*/

        type                nutURoughWallFunction;
        roughnessHeight     0; //smooth, 2.5d50=1.5e-3
        roughnessConstant   0.5;
        roughnessFactor     1;
        value               uniform 0;
    }
    top
    {
        //type            symmetryPlane;
        type    calculated;
        value   uniform 0;
    }
    inletWater
    {
	       type calculated;
    	   value uniform 0;
    }
    inletSediment
    {
	       type calculated;
    	   value uniform 0;
    }
    outletWater
    {
	    type calculated;
    	value uniform 0;
    }
    outletSediment
    {
    	type calculated;
    	value uniform 0;
    }
}
// ************************************************************************* //
