system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    // z = -0.06
    (-0.8 -0.125 -0.06)  // 0
    ( 0.6 -0.125 -0.06)  // 1
    ( 0.6  0.125 -0.06)  // 2
    (-0.8  0.125 -0.06)  // 3

    // z = 0.00
    (-0.8 -0.125  0.00)  // 4
    ( 0.6 -0.125  0.00)  // 5
    ( 0.6  0.125  0.00)  // 6
    (-0.8  0.125  0.00)  // 7

    // z = 0.05
    (-0.8 -0.125  0.05)  // 8
    ( 0.6 -0.125  0.05)  // 9
    ( 0.6  0.125  0.05)  // 10
    (-0.8  0.125  0.05)  // 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (140 25 12)
    simpleGrading (1 1 0.2)
    
    hex (4 5 6 7 8 9 10 11)
    (140 25 12)
    simpleGrading (1 1 5) 
);

boundary
(
    inletSediment
    {
        type patch;
        faces
        (
            (0 4 7 3)  
        );
    }

    inletWater
    {
        type patch;
        faces
        (
            (4 8 11 7)
        );
    }

    outletSediment
    {
        type patch;
        faces
        (
            (1 2 6 5)      
        );
    }

    outletWater
    {
        type patch;
        faces
        (
            (5 6 10 9)
        );
    }

    sideWalls
    {
        type wall;
        faces
        (
            // y = -0.125
            (0 1 5 4)
            (4 5 9 8)

            // y = 0.125
            (3 7 6 2)
            (7 11 10 6)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    top
    {
        type patch; //wall;
        faces
        (
            (8 9 10 11)
        );
    }
);

mergePatchPairs
(
);
