system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Time derivative schemes
ddtSchemes
{
    default         Euler;
}

// Gradient schemes
gradSchemes
{
    default         Gauss linear;
//    grad(k.b)         cellLimited Gauss linear 1;
//    grad(omega.b)     cellLimited Gauss linear 1;
//    grad(epsilon.b)   cellLimited Gauss linear 1;
}

// Divergence schemes
divSchemes
{
    default                         none;
// alphaEqn
    div(phi,alpha)  Gauss limitedLinear01 1; //Gauss upwind; //Gauss limitedLinear01 1; 
    div(phir,alpha) Gauss limitedLinear01 1; //Gauss upwind; //Gauss limitedLinear01 1; 
// UEqn
    div(phia,Ua)    Gauss linearUpwind grad(Ua);
    div(phib,Ub)    Gauss linearUpwind grad(Ub);
    div(phi.a,U.a)    Gauss upwind phi; //Gauss limitedLinearV 1;
    div(phi.b,U.b)    Gauss upwind phi; //Gauss limitedLinearV 1;
    div(phiRa,Ua)   Gauss linear; //Gauss upwind phi;
    div(phiRb,Ub)   Gauss linear; //Gauss upwind phi;
    div(Rca)        Gauss linear;
    div(Rcb)        Gauss linear;
// pEqn
    div(alpha,nu) Gauss linear;
// k and EpsilonEqn
    div(phi.b,k.b)       Gauss linearUpwind grad(k); //Gauss limitedLinear 1;
    div(phi.b,epsilon.b) Gauss linearUpwind grad(epsilon); //Gauss limitedLinear 1;
    div(phi.b,omega.b)   Gauss linearUpwind grad(omega); //Gauss limitedLinear 1;
// alphaPlastic
    div(phia,alphaPlastic)    Gauss upwind; //Gauss limitedLinear01 1;
// pa
    div(phia,pa_new_value)    Gauss upwind; //Gauss limitedLinear 1;
// ThetaEqn
    div(phi,Theta)       Gauss limitedLinear 1;
}

// Laplacian schemes
laplacianSchemes
{
    default         Gauss linear corrected;

    // corrected is more accurate for non-orthogonal meshes,
    // but if the mesh quality is poor, limited corrected can be safer.
//    default                         none; 

// alphaEqn
/*    laplacian(alphaPpMag,alpha) Gauss linear corrected;
    laplacian(kappaAlpha,alpha) Gauss linear corrected;
// UEqn
    laplacian(nuEffa,U.a) Gauss linear corrected;
    laplacian(nuEffb,U.b) Gauss linear corrected;
    laplacian(nuFra,U.a)  Gauss linear corrected;
// pEqn
    laplacian((rho*(1|A(U))),p_rbgh) Gauss linear corrected;
// k and EpsilonEqn
    laplacian(DkEff,k.b) Gauss linear corrected;
    laplacian(DkEff,beta) Gauss linear corrected;
    laplacian(DepsilonEff,epsilon.b) Gauss linear corrected;
    laplacian(DomegaEff,omega.b) Gauss linear corrected;
    laplacian(DepsilonEff,beta) Gauss linear corrected;
//ThetaEqn
    laplacian(kappa,Theta) Gauss linear corrected;*/
}

interpolationSchemes
{
    default                         linear;
}

snGradSchemes
{
    default                         corrected;
}

fluxRequired
{
    default                         no;
//    p                               ;
    p_rbgh                           ;
//    alpha                           ;
//    alpha.a                         ;
//    alpha.b                         ;
}

// ************************************************************************* //
